remove mermaid charts; github bug
